# Task#01

In [2]:
import pandas as pd

# Create a Pandas Series that contains the distance of some planets from the Sun.

# Use the name of the planets as the index to your Pandas Series, and the distance

# from the Sun as your data. The distance from the Sun is in units of 10^6 km

distance_from_sun = [149.6, 1433.5, 227.9, 108.2, 778.6]

planets = ['Earth','Saturn', 'Mars','Venus', 'Jupiter']

# Create a Pandas Series using the above data, with the name of the planets as

# the index and the distance from the Sun as your data.

dist_planets = pd.DataFrame(index=planets, data=distance_from_sun)
dist_planets

              0
Earth     149.6
Saturn   1433.5
Mars      227.9
Venus     108.2
Jupiter   778.6

In [9]:
# Calculate the number of minutes it takes sunlight to reach each planet. You can

# do this by dividing the distance from the Sun for each planet by the speed of light.

# Since in the data above the distance from the Sun is in units of 10^6 km, you can

# use a value for the speed of light of c = 18, since light travels 18 x 10^6 km/minute.

time_light = dist_planets/18

# Use Boolean indexing to select only those planets for which sunlight takes less

# than 40 minutes to reach them.

close_planets = time_light[time_light[0] <  40]

In [10]:
close_planets

               0
Earth   8.311111
Mars   12.661111
Venus   6.011111

# Task#02

In [22]:
import pandas as pd

import numpy as np

# Since we will be working with ratings, we will set the precision of our

# dataframes to one decimal place.

pd.options.display.float_format = '{:.1f}'.format

# Create a Pandas DataFrame that contains the ratings some users have given to a

# series of books. The ratings given are in the range from 1 to 5, with 5 being

# the best score. The names of the books, the authors, and the ratings of each user

# are given below:

books = pd.Series(data = ['Great Expectations', 'Of Mice and Men', 'Romeo and Juliet', 'The Time Machine', 'Alice in Wonderland' ])

authors = pd.Series(data = ['Charles Dickens', 'John Steinbeck', 'William Shakespeare', ' H. G. Wells', 'Lewis Carroll' ])

user_1 = pd.Series(data = [3.2, np.nan ,2.5])

user_2 = pd.Series(data = [5., 1.3, 4.0, 3.8])

user_3 = pd.Series(data = [2.0, 2.3, np.nan, 4])

user_4 = pd.Series(data = [4, 3.5, 4, 5, 4.2])

# Users that have np.nan values means that the user has not yet rated that book.

# Use the data above to create a Pandas DataFrame that has the following column
# labels: 'Author', 'Book Title', 'User 1', 'User 2', 'User 3', 'User 4'. Let Pandas

# automatically assign numerical row indices to the DataFrame.



# Create a dictionary with the data given above


data = {
    'Author': authors,
       'Book Title': books,
       'User 1': user_1,
        'User 2': user_2,
        'User 3': user_3,
    'User 4': user_4
       }


# Use the dictionary to create a Pandas DataFrame

book_ratings = pd.DataFrame(data=data)

# If you created the dictionary correctly you should have a Pandas DataFrame

# that has column labels: 'Author', 'Book Title', 'User 1', 'User 2', 'User 3',

# 'User 4' and row indices 0 through 4.

# Now replace all the NaN values in your DataFrame with the average rating in

# each column. Replace the NaN values in place. HINT: you can use the fillna()

# function with the keyword inplace = True, to do this. Write your code below:
book_ratings.fillna(book_ratings.mean(), inplace=True)

best_rated = book_ratings[(book_ratings == 5).any(axis = 1)]['Book Title'].values

C:\Users\HP\AppData\Local\Temp\ipykernel_7992\2566845432.py:68: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  book_ratings.fillna(book_ratings.mean(), inplace=True)